import colorama as clr
clr.init()


logo = clr.Fore.MAGENTA + """
   _____ __  __  _____    _____  _____   ____   _____ 
  / ____|  \/  |/ ____|  |  __ \|  __ \ / __ \ / ____|
 | (___ | \  / | (___    | |  | | |  | | |  | | (___  
  \___ \| |\/| |\___ \   | |  | | |  | | |  | |\___ \ 
  ____) | |  | |____) |  | |__| | |__| | |__| |____) |
 |_____/|_|  |_|_____/   |_____/|_____/ \____/|_____/ 

   """+clr.Fore.GREEN+"""{ip}{proxy}
      """+clr.Fore.RED+"""Created by Romidorka.""" + clr.Fore.CYAN + "\n" * 2

main_menu = """
 1) Атака
 2) Прокси
 3) Настройки
 0) Выход
""" + clr.Fore.BLUE

attack_menu = """
 1) Один номер
 2) Несколько номеров(через пробел)
 3) Номера телефона из файла
 0) Назад
""" + clr.Fore.BLUE

proxy_menu = """
 1) [{}] Без прокси
 2) [{}] Прокси
 3) [{}] Tor
 4) [{}] Tor с автосменой ip
 0) Назад
""" + clr.Fore.BLUE

settings_menu = """
 1) [{}] Отображение ip
 2) [{}] Отображение прокси
 0) Назад
"""

attack_logo = """
          _   _             _    
     /\  | | | |           | |   
    /  \ | |_| |_ __ _  ___| | __
   / /\ \| __| __/ _` |/ __| |/ /
  / ____ \ |_| || (_| | (__|   < 
 /_/    \_\__|\__\__,_|\___|_|\_\ """